joelbrewster_resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-07 Mon 22:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Joel Brewster</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="styles/resume.css" />
</head>
<body>
<div id="content">
<h1 class="title">Joel Brewster</h1>
<ul class="org-ul">
<li>Looking for new opportunities in 2019.</li>
<li>References will gladly be given on request.</li>
</ul>


<ul class="org-ul">
<li><b>Phone</b>: +61 450 512 930</li>
<li><b>Email</b>: hi@joelbrewster.com</li>
<li><b>Homepage</b>: joelbrewster.com</li>
<li><b>Github</b>: github.com/joelbrewster</li>
<li><b>LinkedIn</b>: linkedin.com/in/joelbrewster</li>
</ul>

<div id="outline-container-org00b52ed" class="outline-2">
<h2 id="org00b52ed">SKILLS</h2>
<div class="outline-text-2" id="text-org00b52ed">
<p>
HTML, CSS (SASS, SCSS), JavaScript, jQuery, PHP, Wordpress, Gatsby, ACF, Toolset, Composer, Yarn, Gulp, Git, Bourbon, Neat, Blade, Moustache, Twig, CraftCMS, React, WHM, cPanel, GA, GTM, Mac OS, Linux, Sketch, XD, Photoshop.
</p>
</div>
</div>

<div id="outline-container-org3814a59" class="outline-2">
<h2 id="org3814a59">ABOUT</h2>
<div class="outline-text-2" id="text-org3814a59">
<p>
I am a passionate and curious Melbourne based developer with a penchant for front-end development. I enjoy creating engaging experiences and coding pixel perfect interfaces. I love solving problems, coding, studying, plain text, music and chocolate.
</p>
</div>
</div>

<div id="outline-container-orgc2cc669" class="outline-2">
<h2 id="orgc2cc669">PROJECTS</h2>
<div class="outline-text-2" id="text-orgc2cc669">
</div>
<div id="outline-container-org65e9355" class="outline-3">
<h3 id="org65e9355"><b>Melbourne Innovation Districts</b> - <a href="https://www.mid.org.au">https://www.mid.org.au</a></h3>
</div>
<div id="outline-container-org52b0dec" class="outline-3">
<h3 id="org52b0dec"><b>CMC Rocks</b> - <a href="https://www.cmcrocks.com">https://www.cmcrocks.com</a></h3>
</div>
<div id="outline-container-orgf8a04aa" class="outline-3">
<h3 id="orgf8a04aa"><b>Now Sound</b> - <a href="https://www.nowsound.online">https://www.nowsound.online</a></h3>
</div>
<div id="outline-container-org513b2d2" class="outline-3">
<h3 id="org513b2d2"><b>Melbourne Writers Festival</b> - <a href="https://www.mwf.com.au">https://www.mwf.com.au</a></h3>
</div>
<div id="outline-container-orge133f38" class="outline-3">
<h3 id="orge133f38"><b>Invictus Games</b> - <a href="https://www.invictusgames2018.com">https://www.invictusgames2018.com</a></h3>
</div>
<div id="outline-container-org8cd58a4" class="outline-3">
<h3 id="org8cd58a4"><b>JBL Weekeend warrior</b> - <a href="https://www.jblwwc.com.au">https://www.jblwwc.com.au</a></h3>
</div>
<div id="outline-container-org47b2fc3" class="outline-3">
<h3 id="org47b2fc3"><b>DJ John Howard</b> - <a href="https://www.djjohnhoward.com">https://www.djjohnhoward.com</a></h3>
</div>
<div id="outline-container-org179b54a" class="outline-3">
<h3 id="org179b54a"><b>Rothe Lowman</b> - <a href="https://www.rothelowman.com.au">https://www.rothelowman.com.au</a></h3>
</div>
<div id="outline-container-org40c2cfc" class="outline-3">
<h3 id="org40c2cfc"><b>iConnect Financial</b> - <a href="https://www.iconnectfinancial.com.au">https://www.iconnectfinancial.com.au</a></h3>
</div>
<div id="outline-container-orgc222b46" class="outline-3">
<h3 id="orgc222b46"><b>Bingefest Festival</b> - <a href="http://bingefest.sydneyoperahouse.com">http://bingefest.sydneyoperahouse.com</a></h3>
</div>
<div id="outline-container-org048097d" class="outline-3">
<h3 id="org048097d"><b>The 5th Watches</b> - <a href="https://www.the5th.co">https://www.the5th.co</a></h3>
</div>
<div id="outline-container-orgdd1f650" class="outline-3">
<h3 id="orgdd1f650"><b>Zero-player App</b> - <a href="https://tinyurl.com/zero-player-download">https://tinyurl.com/zero-player-download</a></h3>
</div>
</div>

<div id="outline-container-org818cdc8" class="outline-2">
<h2 id="org818cdc8">EMPLOYMENT HISTORY</h2>
<div class="outline-text-2" id="text-org818cdc8">
</div>
<div id="outline-container-orgfb58edb" class="outline-3">
<h3 id="orgfb58edb"><b>Bone Digital</b></h3>
<div class="outline-text-3" id="text-orgfb58edb">
</div>
<div id="outline-container-org5944f21" class="outline-4">
<h4 id="org5944f21">Feb 2019 - Oct 2019 | Melbourne, Victoria, Australia</h4>
</div>
</div>

<div id="outline-container-orgfcc8b46" class="outline-3">
<h3 id="orgfcc8b46"><b>Bolster</b></h3>
<div class="outline-text-3" id="text-orgfcc8b46">
</div>
<div id="outline-container-org4f5c8c5" class="outline-4">
<h4 id="org4f5c8c5">Jun 2018 - Nov 2018 | Melbourne, Victoria, Australia</h4>
</div>
</div>

<div id="outline-container-orge6a9687" class="outline-3">
<h3 id="orge6a9687"><b>Pugh Morgan</b> (Expect Different)</h3>
<div class="outline-text-3" id="text-orge6a9687">
</div>
<div id="outline-container-orgdbd9c13" class="outline-4">
<h4 id="orgdbd9c13">Jan 2018 - Jun 2018 | Melbourne, Victoria, Australia</h4>
</div>
</div>

<div id="outline-container-org4a8bd94" class="outline-3">
<h3 id="org4a8bd94"><b>Your Creative</b></h3>
<div class="outline-text-3" id="text-org4a8bd94">
</div>
<div id="outline-container-org2f0080c" class="outline-4">
<h4 id="org2f0080c">Jul 2017 - Dec 2017 | Melbourne, Victoria, Australia</h4>
</div>
</div>

<div id="outline-container-org8a5df1e" class="outline-3">
<h3 id="org8a5df1e"><b>Bourne Digital</b></h3>
<div class="outline-text-3" id="text-org8a5df1e">
</div>
<div id="outline-container-org605f4fc" class="outline-4">
<h4 id="org605f4fc">Mar 2017 - Jul 2017 | Melbourne, Victoria, Australia</h4>
</div>
</div>

<div id="outline-container-orgf6870b6" class="outline-3">
<h3 id="orgf6870b6"><b>Love and Money</b></h3>
<div class="outline-text-3" id="text-orgf6870b6">
</div>
<div id="outline-container-org4ffae41" class="outline-4">
<h4 id="org4ffae41">Sep 2016 - Jan 2017 | Melbourne, Victoria, Australia</h4>
</div>
</div>
</div>

<div id="outline-container-org382b394" class="outline-2">
<h2 id="org382b394">EDUCATION</h2>
<div class="outline-text-2" id="text-org382b394">
</div>
<div id="outline-container-orgbf5da73" class="outline-3">
<h3 id="orgbf5da73"><b>General Assembly</b></h3>
<div class="outline-text-3" id="text-orgbf5da73">
<p>
Web Development Immersive <i>2016 (April - July)</i>
</p>
</div>
</div>

<div id="outline-container-orga7dcf9a" class="outline-3">
<h3 id="orga7dcf9a"><b>서강대학교 Sogang University (Seoul)</b></h3>
<div class="outline-text-3" id="text-orga7dcf9a">
<p>
Korean Language Course <i>2010 - 2011</i>
</p>
</div>
</div>

<div id="outline-container-orgf4853a0" class="outline-3">
<h3 id="orgf4853a0"><b>Queensland Conservatorium of Music, Griffith University</b></h3>
<div class="outline-text-3" id="text-orgf4853a0">
<p>
Sound Technology (2 / 3 complete) <i>2006 - 2007</i>
</p>
</div>
</div>

<div id="outline-container-orge7ad3a7" class="outline-3">
<h3 id="orge7ad3a7"><b>Central Queensland Conservatorium of Music</b></h3>
<div class="outline-text-3" id="text-orge7ad3a7">
<p>
B.A of Contemporary Music <i>2003 - 2005</i>
</p>
</div>
</div>
</div>

<div id="outline-container-org7c7c945" class="outline-2">
<h2 id="org7c7c945">LANGUAGES</h2>
<div class="outline-text-2" id="text-org7c7c945">
<p>
English, Korean
</p>
</div>
</div>

<div id="outline-container-org67be3c0" class="outline-2">
<h2 id="org67be3c0">EMPLOYMENT AND EDUCATION EXPERIENCES</h2>
<div class="outline-text-2" id="text-org67be3c0">
</div>
<div id="outline-container-org9ba675c" class="outline-3">
<h3 id="org9ba675c"><b>Bone Digital</b></h3>
<div class="outline-text-3" id="text-org9ba675c">
<p>
<i>Feb 2019 - Oct 2019</i> | Melbourne, Victoria, Australia
</p>

<p>
At Bone Digital I was across the full stack. I set up custom site builds, structure and deploy. I linked up the CMS backend and front end styling. I cleaned up existing builds, converting older Wordpress sites to use a modern compile/deploy setup, fixed bugs and made changes to logic or client feedback changes and updates on frontend and back. Recently, I've set up a Gatsby frontend build with a Wordpress backend <i>(many years worth of blog/post data)</i> using the WP REST API.
</p>

<p>
<i>Gatsby, Wordpress, SASS (BEM), Javascript, jQuery, Swup, ACF, Composer, Yarn, Gulp, Blade, Twig, Git, GA, GTM.</i>
</p>
</div>
</div>

<div id="outline-container-org083aba9" class="outline-3">
<h3 id="org083aba9"><b>Bolster</b></h3>
<div class="outline-text-3" id="text-org083aba9">
<p>
<i>Jun 2018 - Nov 2018</i> | Melbourne, Victoria, Australia
</p>

<p>
At Bolster, I worked on small to medium custom Wordpress builds, landing pages and supported senior developers when needed so they could work on larger builds. I worked on music festival sites and built artist pages and a larger site from start to finish using their Trellis setup. Each site was highly custom, with each module and page having the ability to be altered; from main colors to element alignment and padding options from the backend all reflected on the frontend.
</p>

<p>
<i>Wordpress, SASS (BEM), Javascript, ACF, Composer, Yarn, Gulp, Blade, Twig, Git, GA, GTM.</i>
</p>
</div>
</div>

<div id="outline-container-orgcaf43b0" class="outline-3">
<h3 id="orgcaf43b0"><b>Pugh Morgan</b></h3>
<div class="outline-text-3" id="text-orgcaf43b0">
<p>
<i>Jan 2018 - Jun 2018</i> | Melbourne, Victoria, Australia
</p>

<p>
Pugh Morgan (defunct) was an integrated brand experience agency, focusing on premium creative and cross-channel execution. I worked across two highly custom Wordpress sites (1 autonomously), and a Drupal and Laravel site. I was across the two Wordpress websites from inception from templating UI elements and partials right up to merging and deploying completed code to staging. I also wrote technical documentation to show clients how to use the custom Wordpress builds.
</p>

<p>
<i>Wordpress, Laravel, Drupal, ACF, Toolset, Composer, Yarn, Gulp, Git, Bourbon, Neat, Moustache, Twig.</i>
</p>
</div>
</div>

<div id="outline-container-orgd347ac6" class="outline-3">
<h3 id="orgd347ac6"><b>Your Creative</b></h3>
<div class="outline-text-3" id="text-orgd347ac6">
<p>
<i>Jul 2017 - Dec 2017</i> | Melbourne, Victoria, Australia
</p>

<p>
With YC I mostly worked with Wordpress and a Laravel build across various client types. I worked with designers from a projects inception right until completion and signoff. I set up databases, hosts, staging and production servers, coded solo and with another developer, cut up resources with Photoshop and illustrator, optimised images, setup component examples for layouts, and wrote technical documentation on how to use the CMS for non-technical clients.
</p>

<p>
<i>Wordpress, Laravel, ACF, Composer, Yarn, Git.</i>
</p>
</div>
</div>

<div id="outline-container-orga68d302" class="outline-3">
<h3 id="orga68d302"><b>Bourne Digital</b></h3>
<div class="outline-text-3" id="text-orga68d302">
<p>
<i>Mar 2017 - Jul 2017</i> | Melbourne, Victoria, Australia
</p>

<p>
I was hired at Bourne Digital as a contractor to complete some work on their site. After the first week, I was hired full time to complete various other smaller websites, fix browser compatibility issues on existing work and more recently look into building a CMS remodel of their existing site. Later, I worked with SAP to create business enterprise software. SAP is enterprise resource planning software (Javscript) that deals with systems, applications and products in data processing.
</p>

<p>
<i>Javascript, Wordpress, CraftCMS, SCSS, jQuery, ACF, Gulp, Git, SAP.</i>
</p>
</div>
</div>

<div id="outline-container-orgbdbf859" class="outline-3">
<h3 id="orgbdbf859"><b>Love and Money</b></h3>
<div class="outline-text-3" id="text-orgbdbf859">
<p>
<i>Sep 2016 - Jan 2017</i> | Melbourne, Victoria, Australia
</p>

<p>
Initially, I was hired at Love and Money as a contract worker for one month for a landing page, and then it became monthly from then. At LAM, I worked on smaller sites from start to finish, remodeled existing web pages, created banners, tweaked and optimised code and updated content on Wordpress sites. I really loved working with like minded people and on new and interesting projects with really talented people.
</p>

<p>
<i>Wordpress, SASS, jQuery, ACF, Gulp, Git, EDM, GA.</i>
</p>
</div>
</div>

<div id="outline-container-orge438793" class="outline-3">
<h3 id="orge438793"><b>Web Development Immersive student at General Assembly</b></h3>
<div class="outline-text-3" id="text-orge438793">
<p>
<i>Apr 2016 - Jul 2016</i> | Melbourne, Victoria, Australia
</p>

<p>
I've always liked making things, especially with computers. After a few years of spending all my available free time studying and trying to learn by myself, I decided to relocate back to Australia and try to change careers and work in an industry I'm really passionate about. I've loved the pace of GA and can't wait to create new and interesting things.
</p>
</div>
</div>

<div id="outline-container-org92dc1eb" class="outline-3">
<h3 id="org92dc1eb"><b>School Owner, Instructor at 영어집</b></h3>
<div class="outline-text-3" id="text-org92dc1eb">
<p>
<i>Jan 2014 - Feb 2016</i> | Jeju-Si, Jeju Island, South Korea
</p>

<p>
My wife and I opened a small language school to take on students that expressed an interest in private lessons with her or myself. I really enjoyed finding ways to engage students, from things like word puzzle games, flashcard games, worksheet games and programming iPad games like "Hangman", "guess the number" and "find the missing letters" style games in python.
</p>
</div>
</div>

<div id="outline-container-org4a68383" class="outline-3">
<h3 id="org4a68383"><b>Owner, Part Time Waiter at Winnie's Brunch Café</b></h3>
<div class="outline-text-3" id="text-org4a68383">
<p>
<i>Mar 2012 - Aug 2013</i> | Jeju-Si, Jeju Island, South Korea
</p>

<p>
My wife has always had a dream to open a brunch cafe. I managed online presence and getting local people aware of the cafe by being part of local groups with things like sponsorships, Facebook groups and local cafe blogs. I was working at a language school and working at the cafe in my spare time on serving and marketing.
</p>
</div>
</div>

<div id="outline-container-orgfdeb722" class="outline-3">
<h3 id="orgfdeb722"><b>English Instructor at 영어마루</b></h3>
<div class="outline-text-3" id="text-orgfdeb722">
<p>
<i>Mar 2012 - Mar 2013</i> | Jeju, Jeju Island, South Korea
</p>

<p>
I taught primary, middle and younger high school students. I learnt when teachers regularly check for understanding in the classroom, students become increasingly aware of monitoring their own understanding and skills. This can serve as a model of good study skills that students can use by themselves and not require stimulus or other motivations.
</p>
</div>
</div>

<div id="outline-container-org3f5ac48" class="outline-3">
<h3 id="org3f5ac48"><b>Language Instructor at International Language School Jeju</b></h3>
<div class="outline-text-3" id="text-org3f5ac48">
<p>
<i>Feb 2011 - Feb 2012</i> | Jeju-si, Jeju Island, South Korea
</p>

<p>
I taught primary/ middle school age children and a gifted class of 4 boys who were 6/7 years old. I mostly worked out of company specific materials and made things as fun as possible. I tried to create more engaging ways to make reading and writing fun. I used a lot of music to get students interested in foreign cultures and language. I learnt how to model for students what they are expected to do or produce, especially for new skills or activities by sharing my thought processes.
</p>
</div>
</div>

<div id="outline-container-orgf62940d" class="outline-3">
<h3 id="orgf62940d"><b>English Instructor at Learn To Give Project</b></h3>
<div class="outline-text-3" id="text-orgf62940d">
<p>
<i>Feb 2009 - Jul 2009</i> | Nakhon Ratchasima Thailand
</p>

<p>
I travelled to Thailand with my partner to teach in rural Ubon Ratchathani (Nakhon Ratchasima area) for around 6 months. We stayed with a host family and spent our free time at the school or with families in the area. Our goal was to expose locals to foreigners and to relax when studying. I learnt how to interact with people of different cultures, not having a common language to communicate with and differences in work cultures.
</p>
</div>
</div>

<div id="outline-container-orgc370735" class="outline-3">
<h3 id="orgc370735"><b>Language Instructor at Sogang University Language Program</b></h3>
<div class="outline-text-3" id="text-orgc370735">
<p>
<i>Feb 2008 - Feb 2009</i> | Seoul, South Korea
</p>

<p>
After working at an international college I met so many lovely people that sparked my interest in travel. In Seoul, I was part of a group that taught ESL to primary and middle grade students. I learnt to use visuals, sketches, gestures, intonation, and other nonverbal cues to make both language and content accessible to others. I learnt to be patient, listen and to try to embrace differences. I learnt a lot about myself by being alone in a different country and trying to lead by example.
</p>
</div>
</div>

<div id="outline-container-orgab8c8ff" class="outline-3">
<h3 id="orgab8c8ff"><b>Instructor at Pacific Gateway International College</b></h3>
<div class="outline-text-3" id="text-orgab8c8ff">
<p>
<i>Jan 2007 - Jan 2008</i> | Brisbane, Queensland, Australia
</p>

<p>
I was in charge of creating activities for international students, creating materials and topics for group discussions. I supervised tests and reviewed test materials. I was part of a travel group that helped international students go on trips and meet local people on weekends. I learnt a lot about different cultures but mostly it spurred a wanderlust to break away from what I had and to travel and see more of the world.
</p>
</div>
</div>

<div id="outline-container-org278f183" class="outline-3">
<h3 id="org278f183"><b>Music Instructor at Forte School Of Music</b></h3>
<div class="outline-text-3" id="text-org278f183">
<p>
<i>Nov 2006 - Sep 2007</i> | Brisbane, Queensland, Australia
</p>

<p>
I was in charge of developing children's scale theory/ warm up and review content, developing interest in not so popular music trends with adolescent students and working on various techniques with higher level guitarists. I was exposed to a lot of music that I wouldn't normally listen to or even try to learn. I learnt how to make guitar, jamming, performing and composition less of an enigma and something anyone can enjoy and really grow with.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
